[
  {
    "date": "April 17, 2025",
    "title": "The Grey Zone of Space Property Rights: Can We Redefine the “Ownerless Frontier”?",
    "summary": "If space resources are becoming assets, are we ready with the right frameworks? While exploring the use of Real World Assets (RWA), I found myself reflecting on an unlikely but increasingly relevant asset class: space resources.",
    "url": "https://www.linkedin.com/pulse/next-generation-banking-apps-future-uiux-era-generative-johnny-kao-kdagc"
  },
  {
    "date": "March 26, 2025",
    "title": "The Future of Tokenization: Why RWAs Are the Tipping Point for Financial Transformation",
    "summary": "Ten years ago, blockchain was little more than a playground for miners. Today, it’s steadily evolving into a platform for hosting traditional financial assets. At the center of this transformation is the rapid rise of RWAs—Real-World Assets—a key signal that the shift is underway.",
    "url": "https://www.linkedin.com/pulse/future-tokenization-why-rwas-tipping-point-financial-johnny-kao-co8lc"
  },
  {
    "date": "March 21, 2025",
    "title": "Can Cats Rule the World with AI-Powered Coding?",
    "summary": "As someone deeply passionate about automation, I’ve long been using tools like Zapier to streamline workflows. Recently, I embarked on a journey to explore the true potential of AI in development, aiming to enhance my automation processes through innovative approaches.",
    "url": "https://www.linkedin.com/pulse/can-cats-rule-world-ai-powered-coding-insights-from-johnny-kao-p75xc"
  },
  {
    "date": "March 4, 2025",
    "title": "The Next Generation of Banking Apps: The Future of UI/UX in the Era of Generative AI",
    "summary": "As generative AI transforms how we interact with technology, the boundaries between apps and services are blurring. Users now expect direct answers instead of navigating multiple platforms, fundamentally shifting digital experiences.",
    "url": "https://www.linkedin.com/pulse/next-generation-banking-apps-future-uiux-era-generative-johnny-kao-kdagc"
  }
]
